# Homebrew
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Fonts
cask "font-jetbrains-mono"

# General tools
cask "alacritty"
brew "bat"
cask "brave-browser"
brew "chezmoi"
brew "difftastic"
brew "diffutils"
brew "docker"
brew "docker-buildx"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "just"
cask "logseq"
brew "neovim"
cask "ngrok"
cask "postman"
brew "pre-commit"
brew "ripgrep"
cask "slack"
brew "sponge"
cask "spotify"
brew "starship"
brew "tig"
brew "ugrep"
cask "visual-studio-code"
brew "watch"
brew "wget"
brew "xh"
brew "youtube-dl"
brew "zellij"
cask "zoom"
brew "graphviz"

# JSON stuff
brew "jq"
brew "gron"

# Record cli
brew "agg"
brew "asciinema"
brew "pv"
brew "ffmpeg"

# Protobuf & gRPC
tap "bufbuild/buf"
brew "bufbuild/buf/buf"
brew "grpcurl"
brew "protobuf"

# Programming
brew "node"
brew "deno"
brew "yarn"
brew "go"
tap "golangci/tap"
brew "golangci/tap/golangci-lint"
tap "tinygo-org/tools"
brew "tinygo-org/tools/tinygo"
brew "llvm"

brew "wazero"

# Kubernetes
brew "colima"
brew "k3d"
brew "kind"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "helm"
brew "kubectx"
tap "vmware-tanzu/carvel"
brew "vmware-tanzu/carvel/kapp"
tap "cue-lang/tap"
brew "cue-lang/tap/cue"
brew "dive"
tap "kubeshark/kubeshark"
brew "kubeshark/kubeshark/kubeshark"
brew "vcluster"
brew "clusterctl"
brew "minikube"
brew "operator-sdk"
brew "kubevela"

# Infrastructure
brew "awscli"
cask "session-manager-plugin"
brew "terraform"
tap "hashicorp/tap"
brew "hashicorp/tap/packer"
tap "pulumi/tap"
brew "pulumi/tap/pulumi"
brew "pulumi/tap/pulumictl"
brew "pulumi/tap/tf2pulumi"
brew "flyctl"
tap "localstack/tap"
brew "localstack/tap/localstack-cli"
brew "envoy"

# Other
cask "chromedriver"
brew "vmdktool"
